zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/gpio_psoc6able2_124_bga.h
    /* P1.3 */
    P1_3_GPIO                       =  0,       /* GPIO controls 'out' */
    P1_3_GPIO_DSI                   =  1,       /* GPIO controls 'out', DSI controls 'output enable' */
    P1_3_DSI_DSI                    =  2,       /* DSI controls 'out' and 'output enable' */
    P1_3_DSI_GPIO                   =  3,       /* DSI controls 'out', GPIO controls 'output enable' */
    P1_3_AMUXA                      =  4,       /* Analog mux bus A */
    P1_3_AMUXB                      =  5,       /* Analog mux bus B */
    P1_3_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P1_3_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P1_3_TCPWM0_LINE_COMPL4         =  8,       /* Digital Active - tcpwm[0].line_compl[4]:4 */
    P1_3_TCPWM1_LINE_COMPL12        =  9,       /* Digital Active - tcpwm[1].line_compl[12]:1 */
    P1_3_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:9 */
    P1_3_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:9 */
    P1_3_LCD_COM9                   = 12,       /* Digital Deep Sleep - lcd.com[9]:0 */
    P1_3_LCD_SEG9                   = 13,       /* Digital Deep Sleep - lcd.seg[9]:0 */
    P1_3_SCB7_UART_CTS              = 18,       /* Digital Active - scb[7].uart_cts:0 */
    P1_3_SCB7_SPI_SELECT0           = 20,       /* Digital Active - scb[7].spi_select0:0 */

    /* P1.4 */
    P1_4_GPIO                       =  0,       /* GPIO controls 'out' */
    P1_4_GPIO_DSI                   =  1,       /* GPIO controls 'out', DSI controls 'output enable' */
    P1_4_DSI_DSI                    =  2,       /* DSI controls 'out' and 'output enable' */
    P1_4_DSI_GPIO                   =  3,       /* DSI controls 'out', GPIO controls 'output enable' */
    P1_4_AMUXA                      =  4,       /* Analog mux bus A */
    P1_4_AMUXB                      =  5,       /* Analog mux bus B */
    P1_4_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P1_4_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P1_4_TCPWM0_LINE5               =  8,       /* Digital Active - tcpwm[0].line[5]:4 */
    P1_4_TCPWM1_LINE13              =  9,       /* Digital Active - tcpwm[1].line[13]:1 */
    P1_4_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:10 */
    P1_4_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:10 */
    P1_4_LCD_COM10                  = 12,       /* Digital Deep Sleep - lcd.com[10]:0 */
    P1_4_LCD_SEG10                  = 13,       /* Digital Deep Sleep - lcd.seg[10]:0 */
    P1_4_SCB7_SPI_SELECT1           = 20,       /* Digital Active - scb[7].spi_select1:0 */

    /* P1.5 */
    P1_5_GPIO                       =  0,       /* GPIO controls 'out' */
    P1_5_GPIO_DSI                   =  1,       /* GPIO controls 'out', DSI controls 'output enable' */
    P1_5_DSI_DSI                    =  2,       /* DSI controls 'out' and 'output enable' */
    P1_5_DSI_GPIO                   =  3,       /* DSI controls 'out', GPIO controls 'output enable' */
    P1_5_AMUXA                      =  4,       /* Analog mux bus A */
    P1_5_AMUXB                      =  5,       /* Analog mux bus B */
    P1_5_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P1_5_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P1_5_TCPWM0_LINE_COMPL5         =  8,       /* Digital Active - tcpwm[0].line_compl[5]:4 */
    P1_5_TCPWM1_LINE_COMPL14        =  9,       /* Digital Active - tcpwm[1].line_compl[14]:1 */
    P1_5_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:11 */
    P1_5_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:11 */
    P1_5_LCD_COM11                  = 12,       /* Digital Deep Sleep - lcd.com[11]:0 */
    P1_5_LCD_SEG11                  = 13,       /* Digital Deep Sleep - lcd.seg[11]:0 */
    P1_5_SCB7_SPI_SELECT2           = 20,       /* Digital Active - scb[7].spi_select2:0 */

    /* USBDM */
    USBDM_GPIO                      =  0,       /* GPIO controls 'out' */

    /* USBDP */
    USBDP_GPIO                      =  0,       /* GPIO controls 'out' */

    /* P2.0 */
    P2_0_GPIO                       =  0,       /* GPIO controls 'out' */
    P2_0_GPIO_DSI                   =  1,       /* GPIO controls 'out', DSI controls 'output enable' */
    P2_0_DSI_DSI                    =  2,       /* DSI controls 'out' and 'output enable' */
    P2_0_DSI_GPIO                   =  3,       /* DSI controls 'out', GPIO controls 'output enable' */
    P2_0_AMUXA                      =  4,       /* Analog mux bus A */
    P2_0_AMUXB                      =  5,       /* Analog mux bus B */
    P2_0_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P2_0_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P2_0_TCPWM0_LINE6               =  8,       /* Digital Active - tcpwm[0].line[6]:4 */
    P2_0_TCPWM1_LINE15              =  9,       /* Digital Active - tcpwm[1].line[15]:1 */
    P2_0_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:12 */
    P2_0_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:12 */
    P2_0_LCD_COM12                  = 12,       /* Digital Deep Sleep - lcd.com[12]:0 */
    P2_0_LCD_SEG12                  = 13,       /* Digital Deep Sleep - lcd.seg[12]:0 */
    P2_0_SCB1_UART_RX               = 18,       /* Digital Active - scb[1].uart_rx:0 */
    P2_0_SCB1_I2C_SCL               = 19,       /* Digital Active - scb[1].i2c_scl:0 */
    P2_0_SCB1_SPI_MOSI              = 20,       /* Digital Active - scb[1].spi_mosi:0 */
    P2_0_PERI_TR_IO_INPUT4          = 24,       /* Digital Active - peri.tr_io_input[4]:0 */
    P2_0_BLESS_MXD_DPSLP_RET_SWITCH_HV = 28,    /* Digital Deep Sleep - bless.mxd_dpslp_ret_switch_hv */

    /* P2.1 */
    P2_1_GPIO                       =  0,       /* GPIO controls 'out' */
    P2_1_GPIO_DSI                   =  1,       /* GPIO controls 'out', DSI controls 'output enable' */
    P2_1_DSI_DSI                    =  2,       /* DSI controls 'out' and 'output enable' */
    P2_1_DSI_GPIO                   =  3,       /* DSI controls 'out', GPIO controls 'output enable' */
    P2_1_AMUXA                      =  4,       /* Analog mux bus A */
    P2_1_AMUXB                      =  5,       /* Analog mux bus B */
    P2_1_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P2_1_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P2_1_TCPWM0_LINE_COMPL6         =  8,       /* Digital Active - tcpwm[0].line_compl[6]:4 */
    P2_1_TCPWM1_LINE_COMPL15        =  9,       /* Digital Active - tcpwm[1].line_compl[15]:1 */
    P2_1_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:13 */
    P2_1_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:13 */
    P2_1_LCD_COM13                  = 12,       /* Digital Deep Sleep - lcd.com[13]:0 */
    P2_1_LCD_SEG13                  = 13,       /* Digital Deep Sleep - lcd.seg[13]:0 */
    P2_1_SCB1_UART_TX               = 18,       /* Digital Active - scb[1].uart_tx:0 */
    P2_1_SCB1_I2C_SDA               = 19,       /* Digital Active - scb[1].i2c_sda:0 */
    P2_1_SCB1_SPI_MISO              = 20,       /* Digital Active - scb[1].spi_miso:0 */
    P2_1_PERI_TR_IO_INPUT5          = 24,       /* Digital Active - peri.tr_io_input[5]:0 */
    P2_1_BLESS_MXD_DPSLP_RET_LDO_OL_HV = 28,    /* Digital Deep Sleep - bless.mxd_dpslp_ret_ldo_ol_hv */

    /* P2.2 */
    P2_2_GPIO                       =  0,       /* GPIO controls 'out' */
    P2_2_GPIO_DSI                   =  1,       /* GPIO controls 'out', DSI controls 'output enable' */
    P2_2_DSI_DSI                    =  2,       /* DSI controls 'out' and 'output enable' */
    P2_2_DSI_GPIO                   =  3,       /* DSI controls 'out', GPIO controls 'output enable' */
    P2_2_AMUXA                      =  4,       /* Analog mux bus A */
    P2_2_AMUXB                      =  5,       /* Analog mux bus B */
    P2_2_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P2_2_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P2_2_TCPWM0_LINE7               =  8,       /* Digital Active - tcpwm[0].line[7]:4 */
    P2_2_TCPWM1_LINE16              =  9,       /* Digital Active - tcpwm[1].line[16]:1 */
    P2_2_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:14 */
    P2_2_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:14 */
    P2_2_LCD_COM14                  = 12,       /* Digital Deep Sleep - lcd.com[14]:0 */
    P2_2_LCD_SEG14                  = 13,       /* Digital Deep Sleep - lcd.seg[14]:0 */
    P2_2_SCB1_UART_RTS              = 18,       /* Digital Active - scb[1].uart_rts:0 */
    P2_2_SCB1_SPI_CLK               = 20,       /* Digital Active - scb[1].spi_clk:0 */
    P2_2_BLESS_MXD_DPSLP_BUCK_EN    = 28,       /* Digital Deep Sleep - bless.mxd_dpslp_buck_en */

    /* P2.3 */
    P2_3_GPIO                       =  0,       /* GPIO controls 'out' */
    P2_3_GPIO_DSI                   =  1,       /* GPIO controls 'out', DSI controls 'output enable' */
    P2_3_DSI_DSI                    =  2,       /* DSI controls 'out' and 'output enable' */
    P2_3_DSI_GPIO                   =  3,       /* DSI controls 'out', GPIO controls 'output enable' */
    P2_3_AMUXA                      =  4,       /* Analog mux bus A */
    P2_3_AMUXB                      =  5,       /* Analog mux bus B */
    P2_3_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P2_3_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P2_3_TCPWM0_LINE_COMPL7         =  8,       /* Digital Active - tcpwm[0].line_compl[7]:4 */
    P2_3_TCPWM1_LINE_COMPL16        =  9,       /* Digital Active - tcpwm[1].line_compl[16]:1 */
    P2_3_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:15 */
    P2_3_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:15 */
    P2_3_LCD_COM15                  = 12,       /* Digital Deep Sleep - lcd.com[15]:0 */
    P2_3_LCD_SEG15                  = 13,       /* Digital Deep Sleep - lcd.seg[15]:0 */
    P2_3_SCB1_UART_CTS              = 18,       /* Digital Active - scb[1].uart_cts:0 */
    P2_3_SCB1_SPI_SELECT0           = 20,       /* Digital Active - scb[1].spi_select0:0 */
    P2_3_BLESS_MXD_DPSLP_RESET_N    = 28,       /* Digital Deep Sleep - bless.mxd_dpslp_reset_n */

    /* P2.4 */
    P2_4_GPIO                       =  0,       /* GPIO controls 'out' */
    P2_4_GPIO_DSI                   =  1,       /* GPIO controls 'out', DSI controls 'output enable' */
    P2_4_DSI_DSI                    =  2,       /* DSI controls 'out' and 'output enable' */
    P2_4_DSI_GPIO                   =  3,       /* DSI controls 'out', GPIO controls 'output enable' */
    P2_4_AMUXA                      =  4,       /* Analog mux bus A */
    P2_4_AMUXB                      =  5,       /* Analog mux bus B */
    P2_4_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P2_4_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P2_4_TCPWM0_LINE0               =  8,       /* Digital Active - tcpwm[0].line[0]:5 */
    P2_4_TCPWM1_LINE17              =  9,       /* Digital Active - tcpwm[1].line[17]:1 */
    P2_4_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:16 */
    P2_4_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:16 */
    P2_4_LCD_COM16                  = 12,       /* Digital Deep Sleep - lcd.com[16]:0 */
    P2_4_LCD_SEG16                  = 13,       /* Digital Deep Sleep - lcd.seg[16]:0 */
    P2_4_SCB1_SPI_SELECT1           = 20,       /* Digital Active - scb[1].spi_select1:0 */
    P2_4_BLESS_MXD_DPSLP_CLK_EN     = 28,       /* Digital Deep Sleep - bless.mxd_dpslp_clk_en */

    /* P2.5 */
    P2_5_GPIO                       =  0,       /* GPIO controls 'out' */
    P2_5_GPIO_DSI                   =  1,       /* GPIO controls 'out', DSI controls 'output enable' */
    P2_5_DSI_DSI                    =  2,       /* DSI controls 'out' and 'output enable' */
    P2_5_DSI_GPIO                   =  3,       /* DSI controls 'out', GPIO controls 'output enable' */
    P2_5_AMUXA                      =  4,       /* Analog mux bus A */
    P2_5_AMUXB                      =  5,       /* Analog mux bus B */
    P2_5_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P2_5_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P2_5_TCPWM0_LINE_COMPL0         =  8,       /* Digital Active - tcpwm[0].line_compl[0]:5 */
    P2_5_TCPWM1_LINE_COMPL17        =  9,       /* Digital Active - tcpwm[1].line_compl[17]:1 */
    P2_5_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:17 */
    P2_5_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:17 */
    P2_5_LCD_COM17                  = 12,       /* Digital Deep Sleep - lcd.com[17]:0 */
    P2_5_LCD_SEG17                  = 13,       /* Digital Deep Sleep - lcd.seg[17]:0 */
    P2_5_SCB1_SPI_SELECT2           = 20,       /* Digital Active - scb[1].spi_select2:0 */
    P2_5_BLESS_MXD_DPSLP_ISOLATE_N  = 28,       /* Digital Deep Sleep - bless.mxd_dpslp_isolate_n */

